{
  "contact": {
    "phone": "+48 883595 607",
    "email": "artur.fedotiew@gmail.com",
    "website": "https://fedotievlab.vercel.app/",
    "location": "Wroclaw, Poland"
  },
  "skills": [
    {
      "title": "Frontend",
      "type": "percent",
      "subskills": [
        {
          "name": "Angular",
          "percent": 95
        },
        {
          "name": "React",
          "percent": 55
        },
        {
          "name": "Qwik",
          "percent": 30
        },
        {
          "name": "JavaScript",
          "percent": 95
        },
        {
          "name": "TypeScript",
          "percent": 95
        },
        {
          "name": "HTML5",
          "percent": 95
        },
        {
          "name": "CSS/SaSS",
          "percent": 95
        },
        {
          "name": "redux/ngrx",
          "percent": 100
        }
      ]
    },
    {
      "title": "Backend",
      "type": "tag",
      "subskills": [
        {
          "name": "NodeJS"
        },
        {
          "name": "Express"
        },
        {
          "name": "NestJS"
        },
        {
          "name": "TypeORM"
        }
      ]
    },
    {
      "title": "Databases",
      "type": "tag",
      "subskills": [
        {
          "name": "Postgresql"
        },
        {
          "name": "Mongodb"
        },
        {
          "name": "Firebase"
        }
      ]
    },
    {
      "title": "Testing",
      "type": "percent",
      "subskills": [
        {
          "name": "Jest Unit Testing",
          "percent": 90
        },
        {
          "name": "Jasmine/Karma Unit Testing",
          "percent": 90
        },
        {
          "name": "Cypress E2E Testing",
          "percent": 60
        },
        {
          "name": "Cypress Component Testing",
          "percent": 60
        },
        {
          "name": "TDD",
          "percent": 70
        }
      ]
    },

    {
      "title": "Architecture",
      "type": "tag",
      "subskills": [
        {
          "name": "DDD"
        },
        {
          "name": "Nx-Monorepo"
        },
        {
          "name": "MFE"
        },
        {
          "name": "Clean Arch."
        },
        {
          "name": "Hexagonal Arch."
        }
      ]
    },
    {
      "title": "Version control tools",
      "type": "tag",
      "subskills": [
        {
          "name": "Github"
        },
        {
          "name": "Bitbucket"
        },
        {
          "name": "GitLab"
        },
        {
          "name": "Azure DevOps"
        }
      ]
    },
    {
      "title": "Languages",
      "type": "percent",
      "subskills": [
        {
          "name": "English",
          "percent": 85
        },
        {
          "name": "German",
          "percent": 25
        },
        {
          "name": "Bulgarian",
          "percent": 25
        },
        {
          "name": "Ukrainian",
          "percent": 100
        },
        {
          "name": "Russian",
          "percent": 100
        }
      ]
    }
  ],
  "summary": "Around 6 years of experience in developing Web applications using HTML + CSS, SASS, JavaScript, TypeScript. Deep knowledge in developing huge enterprise SPA's using Angular 6-13 and associated tools. Experience making client side architectural solutions, working with mono-repository architecture, DDD methodology, and lately micro front-ends with Module Federation approach. Experience in developing Browser agnostic Web extensions. </br></br> Experience with leading up to 10 FE developers and taking part in mentoring, and onboarding processes. Participation in projects with distributed teams with a size of up to 100 persons, with the different SDLC, staff models and business domains. As a result, I have a strong understanding of developing products from scratch by a huge and small teams with a high focus on code quality, compliance to SOLID principles and test coverage. Also, I like to share my knowledge during meetups and by mentoring. </br></br> Designing software is my passion which is supported by curiosity and dedication to self-improvement. Therefore, I am looking for the enterprise projects environment which has a strong development culture and is focused on the highest standards.",
  "education": [
    {
      "institution": "Kremenchuk State Polytechnical University, Ukraine",
      "degree": "Master's Degree of Electrical and Electronics Engineering",
      "start": "2011",
      "end": "20017"
    }
  ],
  "experience": [
    {
      "role": "Software Engineer",
      "company": "Dash Financial technologies",
      "responsibilities": [
        "Development of the client system for the financial company.",
        "Working with high load and high availability system built with Angular 14-15.",
        "Building UI with high load real time data processing UI with AG-grid.",
        "Building reusable UI components with Angular Material.",
        "Implementing reusable mat-form-fields, form controls, and form components with Angular Reactive Forms and Angular Material.",
        "Managing local state with NgRx Component Store and RxJS.",
        "Refactoring of legacy codebase to the new architecture with a use of DDD methodology and NX-workspace.",
        "Improving the code quality and test coverage by migrating to Jest and Cypress as a testing tools for unit and e2e tests respectively.",
        "Introducing Cypress component-testing for the UI components testing.",
        "Improving the CI/CD process by introducing NX cloud, affected commands and NX cache.",
        "Working with Bitbucket version control system."
      ],
      "start": "05/2017",
      "end": "11/2018"
    },
    {
      "role": "Senior software developer at Ciklum",
      "company": "Ciklum",
      "responsibilities": [
        "<b>Leading a FE sub-domain team</b>",
        "Participating and ensuring proper client-side architectural solutions to enable autarkic teams, independent deployments possibilities, accelerated on-boarding processes, quality and speed of product delivery.",
        "Use of NX-workspace tools for building a product with mono-repo architecture.",
        "Ensuring code quality and decoupling between domain, which with a use of nx speeds-up CI/CD process, and decreases team dependencies inside repository.",
        "Lately, extensive studying and analysis of different approaches, drawbacks and benefits of introducing micro front-end architecture, mainly with Module Federation approach.",
        "Continuously working with documentation.",
        "Responsible for creating responsive UI/UX with HTML, CSS3, SASS, TypeScript, Angular 10-12.",
        "Performance-tuning by applying practices of code splitting and lazy loading approaches to large-list UI components, networking, and cashing.",
        "Developing of reusable components",
        "Unit testing with Jest.",
        "Working by Agile Scrum methodology and MS Azure is used as a version control tool",
        "Mentorship"
      ],
      "secondaryResponsibilities": [
        "Part-time work on internal BE project meant to automate interview processes inside a company.",
        "Implementing features with nestjs, postgreSQL database, Typeorm"
      ],
      "start": "07/2020",
      "end": "08/2021"
    },
    {
      "role": "Front End Developer",
      "company": "AndersenLab",
      "responsibilities": [
        "Responsible for creating efficient design and developing User Interaction screens using HTML, CSS3, SASS, TypeScript, Angular 6-10.",
        "Developed Chrome Extension using Angular 8, and custom redux store implementation.",
        "Extensively worked with NgRx state management.",
        "Building reactive UI using RxJs library capabilities for push based architecture.",
        "Developed reusable components for internal design system using Ant Design.",
        "Worked with Jasmine and Karma, Jest for unit testing.",
        "Designed and developed the application using Agile Scrum methodology.",
        "Used JIRA for bug tracking. Git is used as a version control tool and Jenkins is used for continuous integration of builds."
      ],
      "start": "11/2018",
      "end": "07/2020"
    },
    {
      "role": "JavaScript developer",
      "company": "RiverSoft",
      "responsibilities": [
        "Designing and developing the web application using HTML5, CSS3, Bootstrap, JavaScript.",
        "Extensive usage of Bootstrap for layout as well as responsive design and SASS for Responsive design.",
        "Performed unit testing after writing the code by using Jest Framework.",
        "Designed and developed the application using Agile Scrum methodology."
      ],
      "start": "05/2017",
      "end": "11/2018"
    }
  ],
  "social": [
    {
      "service": "youtube",
      "url": "https://www.youtube.com/channel/UCczRc31u_YXNiSpYKxQU_Ug"
    },
    {
      "service": "linkedin",
      "url": "https://www.linkedin.com/in/barancezayirli"
    },
    {
      "service": "twitter",
      "url": "https://twitter.com/barancezayirli"
    },
    {
      "service": "angellist",
      "url": "https://angel.co/baran-cezayirli"
    },
    {
      "service": "github",
      "url": "https://github.com/barancezayirli"
    },
    {
      "service": "facebook",
      "url": "https://www.facebook.com/barancezayirli"
    },
    {
      "service": "instagram",
      "url": "https://www.instagram.com/barancezayirli"
    }
  ],
  "role": "Software Engineer",
  "hobbies": [
    "gym",
    "hiking",
    "bicycling",
    "languages",
    "neural biology",
    "techs I don't use at work"
  ],
  "fullname": "Artur Fedotiev"
}
